## Plan for org_account/iam_identity_center
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 9 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                                NAME                                                 |
|--------|-----------------------------------------------------------------------------------------------------|
| add    | `aws_identitystore_group.forms_production_admin`                                                    |
|        | `aws_identitystore_group.forms_production_read_only`                                                |
|        | `aws_identitystore_group.forms_staging_admin`                                                       |
|        | `aws_identitystore_group.forms_staging_read_only`                                                   |
|        | `aws_ssoadmin_account_assignment.forms_production[&quot;Forms-Production-Admin-AWSAdministratorAccess&quot;]` |
|        | `aws_ssoadmin_account_assignment.forms_production[&quot;Forms-Production-ReadOnly-AWSReadOnlyAccess&quot;]`   |
|        | `aws_ssoadmin_account_assignment.forms_staging[&quot;Forms-Staging-Admin-AWSAdministratorAccess&quot;]`       |
|        | `aws_ssoadmin_account_assignment.forms_staging[&quot;Forms-Staging-ReadOnly-AWSReadOnlyAccess&quot;]`         |
|        | `aws_ssoadmin_account_assignment.forms_staging[&quot;Forms-Staging-ReadOnly-Billing-ReadOnly&quot;]`          |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_identitystore_group.forms_production_admin will be created
  + resource "aws_identitystore_group" "forms_production_admin" {
      + description       = "Grants members administrator access to the GC Forms Production account."
      + display_name      = "Forms-Production-Admin"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_identitystore_group.forms_production_read_only will be created
  + resource "aws_identitystore_group" "forms_production_read_only" {
      + description       = "Grants members read-only access to the GC Forms Production account."
      + display_name      = "Forms-Production-ReadOnly"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_identitystore_group.forms_staging_admin will be created
  + resource "aws_identitystore_group" "forms_staging_admin" {
      + description       = "Grants members administrator access to the GC Forms Staging account."
      + display_name      = "Forms-Staging-Admin"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_identitystore_group.forms_staging_read_only will be created
  + resource "aws_identitystore_group" "forms_staging_read_only" {
      + description       = "Grants members read-only access to the GC Forms Staging account."
      + display_name      = "Forms-Staging-ReadOnly"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_ssoadmin_account_assignment.articles_production["Articles-Production-Admin"] has moved to aws_ssoadmin_account_assignment.articles_production["Articles-Production-Admin-AWSAdministratorAccess"]
    resource "aws_ssoadmin_account_assignment" "articles_production" {
        id                 = "7c0d55b8-8001-7007-681b-a537537fa92d,GROUP,472286471787,AWS_ACCOUNT,arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-37cc13ae63647ac6,arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
        # (6 unchanged attributes hidden)
    }

  # aws_ssoadmin_account_assignment.articles_production["Articles-Production-ReadOnly"] has moved to aws_ssoadmin_account_assignment.articles_production["Articles-Production-ReadOnly-AWSReadOnlyAccess"]
    resource "aws_ssoadmin_account_assignment" "articles_production" {
        id                 = "dc9d1558-5091-70a9-42e9-8a7d127ee16a,GROUP,472286471787,AWS_ACCOUNT,arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-6f8897f9e56fb805,arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
        # (6 unchanged attributes hidden)
    }

  # aws_ssoadmin_account_assignment.articles_staging["Articles-Staging-Admin"] has moved to aws_ssoadmin_account_assignment.articles_staging["Articles-Staging-Admin-AWSAdministratorAccess"]
    resource "aws_ssoadmin_account_assignment" "articles_staging" {
        id                 = "fccd2538-6091-70c4-70d4-59d5c3913655,GROUP,729164266357,AWS_ACCOUNT,arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-37cc13ae63647ac6,arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
        # (6 unchanged attributes hidden)
    }

  # aws_ssoadmin_account_assignment.articles_staging["Articles-Staging-ReadOnly"] has moved to aws_ssoadmin_account_assignment.articles_staging["Articles-Staging-ReadOnly-AWSReadOnlyAccess"]
    resource "aws_ssoadmin_account_assignment" "articles_staging" {
        id                 = "3c3d5568-1041-70de-1261-2ccfa2cca166,GROUP,729164266357,AWS_ACCOUNT,arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-6f8897f9e56fb805,arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
        # (6 unchanged attributes hidden)
    }

  # aws_ssoadmin_account_assignment.forms_production["Forms-Production-Admin-AWSAdministratorAccess"] will be created
  + resource "aws_ssoadmin_account_assignment" "forms_production" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-37cc13ae63647ac6"
      + principal_id       = (known after apply)
      + principal_type     = "GROUP"
      + target_id          = "957818836222"
      + target_type        = "AWS_ACCOUNT"
    }

  # aws_ssoadmin_account_assignment.forms_production["Forms-Production-ReadOnly-AWSReadOnlyAccess"] will be created
  + resource "aws_ssoadmin_account_assignment" "forms_production" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-6f8897f9e56fb805"
      + principal_id       = (known after apply)
      + principal_type     = "GROUP"
      + target_id          = "957818836222"
      + target_type        = "AWS_ACCOUNT"
    }

  # aws_ssoadmin_account_assignment.forms_staging["Forms-Staging-Admin-AWSAdministratorAccess"] will be created
  + resource "aws_ssoadmin_account_assignment" "forms_staging" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-37cc13ae63647ac6"
      + principal_id       = (known after apply)
      + principal_type     = "GROUP"
      + target_id          = "687401027353"
      + target_type        = "AWS_ACCOUNT"
    }

  # aws_ssoadmin_account_assignment.forms_staging["Forms-Staging-ReadOnly-AWSReadOnlyAccess"] will be created
  + resource "aws_ssoadmin_account_assignment" "forms_staging" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-6f8897f9e56fb805"
      + principal_id       = (known after apply)
      + principal_type     = "GROUP"
      + target_id          = "687401027353"
      + target_type        = "AWS_ACCOUNT"
    }

  # aws_ssoadmin_account_assignment.forms_staging["Forms-Staging-ReadOnly-Billing-ReadOnly"] will be created
  + resource "aws_ssoadmin_account_assignment" "forms_staging" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-155a8dac774b6771"
      + principal_id       = (known after apply)
      + principal_type     = "GROUP"
      + target_id          = "687401027353"
      + target_type        = "AWS_ACCOUNT"
    }

  # aws_ssoadmin_account_assignment.list_manager_production["Articles-Production-Admin"] has moved to aws_ssoadmin_account_assignment.list_manager_production["Articles-Production-Admin-AWSAdministratorAccess"]
    resource "aws_ssoadmin_account_assignment" "list_manager_production" {
        id                 = "7c0d55b8-8001-7007-681b-a537537fa92d,GROUP,762579868088,AWS_ACCOUNT,arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-37cc13ae63647ac6,arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
        # (6 unchanged attributes hidden)
    }

  # aws_ssoadmin_account_assignment.list_manager_production["Articles-Production-ReadOnly"] has moved to aws_ssoadmin_account_assignment.list_manager_production["Articles-Production-ReadOnly-AWSReadOnlyAccess"]
    resource "aws_ssoadmin_account_assignment" "list_manager_production" {
        id                 = "dc9d1558-5091-70a9-42e9-8a7d127ee16a,GROUP,762579868088,AWS_ACCOUNT,arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-6f8897f9e56fb805,arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
        # (6 unchanged attributes hidden)
    }

  # aws_ssoadmin_account_assignment.notify_dev["Notify-Dev-Admin"] has moved to aws_ssoadmin_account_assignment.notify_dev["Notify-Dev-Admin-AWSAdministratorAccess"]
    resource "aws_ssoadmin_account_assignment" "notify_dev" {
        id                 = "7c7d0578-00c1-70ef-513d-bb1f4fd6b01c,GROUP,800095993820,AWS_ACCOUNT,arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-37cc13ae63647ac6,arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
        # (6 unchanged attributes hidden)
    }

  # aws_ssoadmin_account_assignment.notify_dev["Notify-Dev-ReadOnly"] has moved to aws_ssoadmin_account_assignment.notify_dev["Notify-Dev-ReadOnly-AWSReadOnlyAccess"]
    resource "aws_ssoadmin_account_assignment" "notify_dev" {
        id                 = "dc9d6598-e0a1-70bd-00ff-b359576ec6d6,GROUP,800095993820,AWS_ACCOUNT,arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-6f8897f9e56fb805,arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
        # (6 unchanged attributes hidden)
    }

  # aws_ssoadmin_account_assignment.notify_production["Notify-Production-Admin"] has moved to aws_ssoadmin_account_assignment.notify_production["Notify-Production-Admin-AWSAdministratorAccess"]
    resource "aws_ssoadmin_account_assignment" "notify_production" {
        id                 = "ecdda5f8-70f1-7064-fa47-ac20e48485e1,GROUP,296255494825,AWS_ACCOUNT,arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-37cc13ae63647ac6,arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
        # (6 unchanged attributes hidden)
    }

  # aws_ssoadmin_account_assignment.notify_production["Notify-Production-Billing-ReadOnly"] has moved to aws_ssoadmin_account_assignment.notify_production["Notify-Production-Billing-ReadOnly-Billing-ReadOnly"]
    resource "aws_ssoadmin_account_assignment" "notify_production" {
        id                 = "9c0d2508-4091-7014-8ee8-b71b8913fca4,GROUP,296255494825,AWS_ACCOUNT,arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-155a8dac774b6771,arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
        # (6 unchanged attributes hidden)
    }

  # aws_ssoadmin_account_assignment.notify_production["Notify-Production-ECS-Blazer-Access"] has moved to aws_ssoadmin_account_assignment.notify_production["Notify-Production-ECS-Blazer-Access-ECS-Blazer-Access"]
    resource "aws_ssoadmin_account_assignment" "notify_production" {
        id                 = "5c3dc5b8-0071-7085-a3a9-4639c7dbe60e,GROUP,296255494825,AWS_ACCOUNT,arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-a925e7b06558df03,arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
        # (6 unchanged attributes hidden)
    }

  # aws_ssoadmin_account_assignment.notify_production["Notify-Production-Pinpoint-SMS-Admin"] has moved to aws_ssoadmin_account_assignment.notify_production["Notify-Production-Pinpoint-SMS-Admin-Pinpoint-SMS-Admin"]
    resource "aws_ssoadmin_account_assignment" "notify_production" {
        id                 = "fcdd1588-f081-7062-02b0-adc849949eb2,GROUP,296255494825,AWS_ACCOUNT,arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-acdba9e0321556fd,arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
        # (6 unchanged attributes hidden)
    }

  # aws_ssoadmin_account_assignment.notify_production["Notify-Production-QuickSight-Access"] has moved to aws_ssoadmin_account_assignment.notify_production["Notify-Production-QuickSight-Access-Quicksight"]
    resource "aws_ssoadmin_account_assignment" "notify_production" {
        id                 = "ec4df5d8-20c1-7042-de71-5539c224c789,GROUP,296255494825,AWS_ACCOUNT,arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-c94c49efefccf66f,arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
        # (6 unchanged attributes hidden)
    }

  # aws_ssoadmin_account_assignment.notify_production["Notify-Production-ReadOnly"] has moved to aws_ssoadmin_account_assignment.notify_production["Notify-Production-ReadOnly-AWSReadOnlyAccess"]
    resource "aws_ssoadmin_account_assignment" "notify_production" {
        id                 = "bc7d5518-e011-700c-436d-363f0012da6b,GROUP,296255494825,AWS_ACCOUNT,arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-6f8897f9e56fb805,arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
        # (6 unchanged attributes hidden)
    }

  # aws_ssoadmin_account_assignment.notify_production["Notify-Production-S3-WebsiteAssets-Admin"] has moved to aws_ssoadmin_account_assignment.notify_production["Notify-Production-S3-WebsiteAssets-Admin-S3-NotifyWebsiteAssets-Admin"]
    resource "aws_ssoadmin_account_assignment" "notify_production" {
        id                 = "9cadf568-c011-70bd-2e00-0feaede5b5aa,GROUP,296255494825,AWS_ACCOUNT,arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-a4166e97ba82e2fe,arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
        # (6 unchanged attributes hidden)
    }

  # aws_ssoadmin_account_assignment.notify_production["Notify-Production-SupportCenter-Admin"] has moved to aws_ssoadmin_account_assignment.notify_production["Notify-Production-SupportCenter-Admin-SupportCenter-Admin"]
    resource "aws_ssoadmin_account_assignment" "notify_production" {
        id                 = "dcfd15c8-d0a1-70b9-22de-54e67e2a14d7,GROUP,296255494825,AWS_ACCOUNT,arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-2ab58d687dc55f19,arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
        # (6 unchanged attributes hidden)
    }

  # aws_ssoadmin_account_assignment.notify_sandbox["Notify-Sandbox-Admin"] has moved to aws_ssoadmin_account_assignment.notify_sandbox["Notify-Sandbox-Admin-AWSAdministratorAccess"]
    resource "aws_ssoadmin_account_assignment" "notify_sandbox" {
        id                 = "3c3df548-b081-7030-37f0-30471d7f1568,GROUP,891376947407,AWS_ACCOUNT,arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-37cc13ae63647ac6,arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
        # (6 unchanged attributes hidden)
    }

  # aws_ssoadmin_account_assignment.notify_sandbox["Notify-Sandbox-ReadOnly"] has moved to aws_ssoadmin_account_assignment.notify_sandbox["Notify-Sandbox-ReadOnly-AWSReadOnlyAccess"]
    resource "aws_ssoadmin_account_assignment" "notify_sandbox" {
        id                 = "3c2dd518-7041-7086-496f-59aa7c7c3d41,GROUP,891376947407,AWS_ACCOUNT,arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-6f8897f9e56fb805,arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
        # (6 unchanged attributes hidden)
    }

  # aws_ssoadmin_account_assignment.notify_staging["Notify-Staging-Admin"] has moved to aws_ssoadmin_account_assignment.notify_staging["Notify-Staging-Admin-AWSAdministratorAccess"]
    resource "aws_ssoadmin_account_assignment" "notify_staging" {
        id                 = "4cfdb548-c091-7006-9f2f-fdfa6a386866,GROUP,239043911459,AWS_ACCOUNT,arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-37cc13ae63647ac6,arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
        # (6 unchanged attributes hidden)
    }

  # aws_ssoadmin_account_assignment.notify_staging["Notify-Staging-Billing-ReadOnly"] has moved to aws_ssoadmin_account_assignment.notify_staging["Notify-Staging-Billing-ReadOnly-Billing-ReadOnly"]
    resource "aws_ssoadmin_account_assignment" "notify_staging" {
        id                 = "9c7d4508-2011-7020-d228-e319be7439fb,GROUP,239043911459,AWS_ACCOUNT,arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-155a8dac774b6771,arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
        # (6 unchanged attributes hidden)
    }

  # aws_ssoadmin_account_assignment.notify_staging["Notify-Staging-ECS-Blazer-Access"] has moved to aws_ssoadmin_account_assignment.notify_staging["Notify-Staging-ECS-Blazer-Access-ECS-Blazer-Access"]
    resource "aws_ssoadmin_account_assignment" "notify_staging" {
        id                 = "1ced3598-c091-7032-44a2-1e5881fd1988,GROUP,239043911459,AWS_ACCOUNT,arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-a925e7b06558df03,arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
        # (6 unchanged attributes hidden)
    }

  # aws_ssoadmin_account_assignment.notify_staging["Notify-Staging-Pinpoint-SMS-Admin"] has moved to aws_ssoadmin_account_assignment.notify_staging["Notify-Staging-Pinpoint-SMS-Admin-Pinpoint-SMS-Admin"]
    resource "aws_ssoadmin_account_assignment" "notify_staging" {
        id                 = "1c1d35b8-a071-70dd-4cee-00cc18b0e421,GROUP,239043911459,AWS_ACCOUNT,arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-acdba9e0321556fd,arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
        # (6 unchanged attributes hidden)
    }

  # aws_ssoadmin_account_assignment.notify_staging["Notify-Staging-ReadOnly"] has moved to aws_ssoadmin_account_assignment.notify_staging["Notify-Staging-ReadOnly-AWSReadOnlyAccess"]
    resource "aws_ssoadmin_account_assignment" "notify_staging" {
        id                 = "ec0d9548-40a1-703f-e4d6-acbf2995180a,GROUP,239043911459,AWS_ACCOUNT,arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-6f8897f9e56fb805,arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
        # (6 unchanged attributes hidden)
    }

  # aws_ssoadmin_account_assignment.notify_staging["Notify-Staging-S3-WebsiteAssets-Admin"] has moved to aws_ssoadmin_account_assignment.notify_staging["Notify-Staging-S3-WebsiteAssets-Admin-S3-NotifyWebsiteAssets-Admin"]
    resource "aws_ssoadmin_account_assignment" "notify_staging" {
        id                 = "ac7d6518-60f1-70cd-ce7f-192a8e88b67e,GROUP,239043911459,AWS_ACCOUNT,arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-a4166e97ba82e2fe,arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
        # (6 unchanged attributes hidden)
    }

  # aws_ssoadmin_account_assignment.notify_staging["Notify-Staging-SupportCenter-Admin"] has moved to aws_ssoadmin_account_assignment.notify_staging["Notify-Staging-SupportCenter-Admin-SupportCenter-Admin"]
    resource "aws_ssoadmin_account_assignment" "notify_staging" {
        id                 = "0c1d0578-20f1-70e9-a9a6-6a67f7ecaa57,GROUP,239043911459,AWS_ACCOUNT,arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-2ab58d687dc55f19,arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
        # (6 unchanged attributes hidden)
    }

Plan: 9 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_ssoadmin_permission_set.admin_pinpoint_sms"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssoadmin_permission_set.admin_s3_website_assets"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssoadmin_permission_set.admin_support_center"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssoadmin_permission_set.notify_access_ecs_blazer"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssoadmin_permission_set.quicksight"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssoadmin_permission_set.read_only_billing"]

25 tests, 19 passed, 6 warnings, 0 failures, 0 exceptions

```

</details>
